# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [3]:
import pandas as pd
from io import StringIO

In [4]:
import requests

url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
response = requests.get(url)


if response.status_code == 200:
    with open('occupation.csv', 'wb') as file:
        file.write(response.content)
    
else:
    print("Failed ")

In [4]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user"
occc=pd.read_csv(url,delimiter='\t')
occc.head(10)

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043
2                    3|23|M|writer|32067
3                4|24|M|technician|43537
4                     5|33|F|other|15213
5                 6|42|M|executive|98101
6             7|57|M|administrator|91344
7             8|36|M|administrator|05201
8                   9|29|M|student|01002
9                   10|53|M|lawyer|90703

In [5]:
data=pd.read_csv(r'C:\Users\GASTO\Desktop\Projects\intro to pandas\occupation.csv')

In [6]:
data

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [7]:
data.head()

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043
2                    3|23|M|writer|32067
3                4|24|M|technician|43537
4                     5|33|F|other|15213

In [5]:


# Your data in string format
data = """user_id|age|gender|occupation|zip_code
1|24|M|technician|85711
2|53|F|other|94043
3|23|M|writer|32067
4|24|M|technician|43537
5|33|F|other|15213"""

# Use StringIO to simulate reading from a file
data_io = StringIO(data)

# Read the data into a DataFrame
users= pd.read_csv(data_io, delimiter='|')

In [6]:
users

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
1        2   53      F       other     94043
2        3   23      M      writer     32067
3        4   24      M  technician     43537
4        5   33      F       other     15213

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [38]:
users

   user_id  age gender  occupation  zip_code
0        1   24      M  technician     85711
1        2   53      F       other     94043
2        3   23      M      writer     32067
3        4   24      M  technician     43537
4        5   33      F       other     15213

### Step 4. Discover what is the mean age per occupation

In [16]:
users.groupby('occupation')['age'].mean().reset_index()

   occupation   age
0       other  43.0
1  technician  24.0
2      writer  23.0

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [35]:
male_users=users[users['gender']=='M']
group=male_users.groupby('occupation')['age'].agg(['max','min']).reset_index()
group

   occupation  max  min
0  technician   24   24
1      writer   23   23

### Step 6. For each occupation, calculate the minimum and maximum ages

In [34]:
users.groupby('occupation')['age'].agg(['max','min'])

            max  min
occupation
other        53   33
technician   24   24
writer       23   23

### Step 7. For each combination of occupation and gender, calculate the mean age

In [45]:
d1=users.groupby(['occupation','gender'])['age'].mean()
d1

occupation  gender
other       F         43.0
technician  M         24.0
writer      M         23.0
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [ ]:
pd.DataFrame('occupation')['gender']*100